app/Controllers/Barang.php

SELECT *
FROM `kategori`
ORDER BY `nama_kategori` ASC
---
    public function edit($id)
    {
        $barang = $this->barangModel->find($id);
        if (!$barang) {
            return redirect()->to('/barang')->with('error', 'Data barang tidak ditemukan.');
        }

        return view('barang/edit', [
            'title' => 'Edit Barang',
            'barang' => $barang,
            'kategori' => $this->kategoriModel->orderBy('nama_kategori', 'ASC')->findAll(),