app/Controllers/Barang.php

SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
WHERE   (
`barang`.`kode_barang` LIKE '%so%' ESCAPE '!'
OR  `barang`.`nama_barang` LIKE '%so%' ESCAPE '!'
OR  `kategori`.`nama_kategori` LIKE '%so%' ESCAPE '!'
 )
ORDER BY `barang`.`id_barang` DESC
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $keyword = $this->request->getGet('keyword');

        $builder = $this->barangModel
            ->select('barang.*, kategori.nama_kategori')
            ->join(
                'kategori',
                'kategori.id_kategori = barang.id_kategori'
            );

        if ($keyword) {
            $builder->groupStart()
                ->like('barang.kode_barang', $keyword)
                ->orLike('barang.nama_barang', $keyword)
                ->orLike('kategori.nama_kategori', $keyword)
                ->groupEnd();
        }

        $data = [
            'title' => 'Data Barang',
            'barang' => $builder->orderBy('barang.id_barang', 'DESC')->findAll(),

SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
WHERE   (
`barang`.`kode_barang` LIKE '%mie%' ESCAPE '!'
OR  `barang`.`nama_barang` LIKE '%mie%' ESCAPE '!'
OR  `kategori`.`nama_kategori` LIKE '%mie%' ESCAPE '!'
 )
ORDER BY `barang`.`nama_barang` ASC
---
    public function laporanBarang()
{
    $keyword = $this->request->getGet('keyword');

    $builder = $this->barangModel
        ->select('barang.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = barang.id_kategori');

    if ($keyword) {
        $builder->groupStart()
            ->like('barang.kode_barang', $keyword)
            ->orLike('barang.nama_barang', $keyword)
            ->orLike('kategori.nama_kategori', $keyword)
            ->groupEnd();
    }

    $data = [
        'title'   => 'Laporan Barang',
        'barang'  => $builder->orderBy('barang.nama_barang', 'ASC')->findAll(),