app/Controllers/Barang.php

SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
ORDER BY `barang`.`nama_barang` ASC
---
    public function index()
    {
        $keyword = trim((string) $this->request->getGet('keyword'));

        $builder = $this->barangModel
            ->select('barang.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = barang.id_kategori');

        if ($keyword !== '') {
            $builder->groupStart()
                ->like('barang.kode_barang', $keyword)
                ->orLike('barang.nama_barang', $keyword)
                ->orLike('kategori.nama_kategori', $keyword)
                ->groupEnd();
        }

        return view('barang/index', [
            'title' => 'Data Barang',
            'barang' => $builder->orderBy('barang.nama_barang', 'ASC')->paginate(15, 'barang'),

SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '6'
---
            $idBarang = (int) $this->barangModel->getInsertID();

            if ($stokAwal > 0) {
                if (!$this->mutasiModel->insert([
                    'id_barang' => $idBarang,
                    'id_user' => (int) session()->get('id_user'),
                    'tipe' => 'PENYESUAIAN',
                    'qty' => $stokAwal,
                    'stok_sebelum' => 0,
                    'stok_sesudah' => $stokAwal,
                    'referensi_tipe' => 'STOK_AWAL',
                    'referensi_id' => $idBarang,
                    'keterangan' => 'Stok awal saat barang dibuat',
                ])) {