app/Controllers/Customer.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $keyword = $this->request->getGet('keyword');

        $builder = $this->customerModel;

        if ($keyword) {
            $builder->groupStart()
                ->like('nama_customer', $keyword)
                ->orLike('no_telp', $keyword)
                ->orLike('alamat', $keyword)
                ->groupEnd();
        }

        $data = [
            'title' => 'Data Customer',
            'customer' => $builder
                ->orderBy('id_customer', 'DESC')
                ->findAll(),
---
SELECT *
FROM `customer`
ORDER BY `id_customer` DESC