app/Controllers/Dashboard.php

    public function index()
    {
        // Cek login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Statistik
        $totalBarang = $this->barangModel->countAll();

        $totalCustomer = $this->customerModel->countAll();

        $totalTransaksi = $this->penjualanModel->countAll();

        $stokMenipis = $this->barangModel
        ->select('barang.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = barang.id_kategori')
        ->where('barang.stok <=', 5)
        ->orderBy('barang.stok', 'ASC')
        ->findAll();

        // Total penjualan
        $totalPenjualan = $this->penjualanModel
            ->selectSum('total')
            ->first();
---
SELECT COUNT(*) AS `numrows` FROM `barang`
SELECT COUNT(*) AS `numrows` FROM `customer`
SELECT COUNT(*) AS `numrows` FROM `penjualan`
SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
WHERE `barang`.`stok` <= 5
ORDER BY `barang`.`stok` ASC
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `stok` <= 5
SELECT SUM(`total`) AS `total`
FROM `penjualan`
 LIMIT 1