app/Controllers/Penjualan.php

SELECT *
FROM `customer`
ORDER BY `nama_customer` ASC
SELECT *
FROM `barang`
WHERE `stok` > 0
ORDER BY `nama_barang` ASC
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Transaksi Penjualan',

            'customer' => $this->customerModel
                ->orderBy('nama_customer', 'ASC')
                ->findAll(),

            'barang' => $this->barangModel
                ->where('stok >', 0)
                ->orderBy('nama_barang', 'ASC')
                ->findAll()

SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = 18
---
                continue;
            }

            $dataBarang = $this->barangModel->find($id_barang);

SELECT `penjualan`.*, `customer`.`nama_customer`, `users`.`nama_lengkap`
FROM `penjualan`
LEFT JOIN `customer` ON `customer`.`id_customer` = `penjualan`.`id_customer`
JOIN `users` ON `users`.`id_user` = `penjualan`.`id_user`
WHERE `penjualan`.`id_penjualan` = '15'
 LIMIT 1
SELECT `detail_penjualan`.*, `barang`.`kode_barang`, `barang`.`nama_barang`, `barang`.`satuan`
FROM `detail_penjualan`
JOIN `barang` ON `barang`.`id_barang` = `detail_penjualan`.`id_barang`
WHERE `detail_penjualan`.`id_penjualan` = '15'
---
    public function sukses($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $penjualan = $this->penjualanModel
            ->select('penjualan.*, customer.nama_customer, users.nama_lengkap')
            ->join(
                'customer',
                'customer.id_customer = penjualan.id_customer',
                'left'
            )
            ->join(
                'users',
                'users.id_user = penjualan.id_user'
            )
            ->where('penjualan.id_penjualan', $id)
            ->first();

        if (!$penjualan) {
            return redirect()->to('/penjualan')
                ->with('error', 'Transaksi tidak ditemukan.');
        }

        $detail = $this->detailModel
            ->select(
                'detail_penjualan.*, barang.kode_barang, barang.nama_barang, barang.satuan'
            )
            ->join(
                'barang',
                'barang.id_barang = detail_penjualan.id_barang'
            )
            ->where(
                'detail_penjualan.id_penjualan',
                $id
            )
            ->findAll();