app/Controllers/Supplier.php

SELECT *
FROM `supplier`
ORDER BY `id_supplier` DESC
---
    public function index()
    {
        $keyword = trim((string) $this->request->getGet('keyword'));
        $builder = $this->supplierModel;

        if ($keyword !== '') {
            $builder->groupStart()
                ->like('nama_supplier', $keyword)
                ->orLike('no_telp', $keyword)
                ->orLike('alamat', $keyword)
                ->groupEnd();
        }

        return view('supplier/index', [
            'title' => 'Data Supplier',
            'supplier' => $builder->orderBy('id_supplier', 'DESC')->paginate(15, 'supplier'),
            'pager' => $this->supplierModel->pager,
            'supplierStats' => $this->supplierStats(),
            'keyword' => $keyword,
        ]);